{
  "backend/main.mo": "Defines the core backend actor with user profiles, tasks, rewards, quest caching, system settings, and admin authorization state.",
  "feature_evidence.json": "Lists implemented features with associated files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark theme CSS variables and applying global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, app providers, authentication-aware routing, and main page flow.",
  "frontend/src/components/adults/TaskEditorDialog.tsx": "Dialog UI for creating a new adult task with inputs for title, description, points, and type.",
  "frontend/src/components/adults/TaskTable.tsx": "Displays a table of adult tasks with status badges and basic task metadata.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity actions, loading states, and mode‑aware styling.",
  "frontend/src/components/branding/AppLogo.tsx": "Renders the ChoreQuest logo with size‑based styling using an image and gradient text.",
  "frontend/src/components/kids/LeaderboardQuestMap.tsx": "Displays a leaderboard card showing the top 10 users with rank icons, highlighting the current user.",
  "frontend/src/components/kids/QuestCard.tsx": "Shows a task card with progress, status indicators, and buttons to accept or complete quests.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, navigation, theming, and footer, adapting to kids or adult mode.",
  "frontend/src/components/parent/RewardCatalogManager.tsx": "Manages the reward catalog, listing rewards and providing a dialog to create new ones.",
  "frontend/src/components/parent/TaskManager.tsx": "Displays all tasks with a table and opens a dialog to create new tasks.",
  "frontend/src/components/parent/ThemeManager.tsx": "Shows available world themes with preview images and theme descriptions.",
  "frontend/src/components/store/RewardCard.tsx": "Renders a reward card that users can redeem if they have enough points, with kids‑mode styling options.",
  "frontend/src/context/ModeContext.tsx": "Provides context for switching and persisting the UI mode between kids and adults.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking. Includes utilities to create an AuthClient with custom options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, tasks, rewards, and related backend data via an actor. Includes success/error handling and automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS setup with custom design tokens, light/dark theme variables, and global styles. Adds utility classes and base styling overrides.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App. Imports global styles.",
  "frontend/src/pages/adults/AdultsDashboardPage.tsx": "Adult dashboard showing task metrics, task list, and a dialog to create new tasks. Fetches tasks and user profile and displays loading states.",
  "frontend/src/pages/kids/KidsDashboardPage.tsx": "Kids dashboard showing active, available, and completed quests, as well as a leaderboard. Filters tasks by status and displays themed quest cards.",
  "frontend/src/pages/onboarding/AgeSelectionStep.tsx": "Onboarding step letting users select an age bracket and proceed. Updates selected age and triggers callbacks for navigation and selection.",
  "frontend/src/pages/onboarding/AvatarCreatorStep.tsx": "Renders avatar choices with emoji buttons and stores the selected avatar before allowing the user to continue.",
  "frontend/src/pages/onboarding/FirstQuestTutorialStep.tsx": "Shows a tutorial quest intro and completion flow, updating state when the user accepts and finishes the quest.",
  "frontend/src/pages/onboarding/OnboardingFlow.tsx": "Controls the multi‑step onboarding process, storing user input and submitting the profile when complete.",
  "frontend/src/pages/onboarding/ProfileStep.tsx": "Collects the user's display name and proceeds when a valid name is entered.",
  "frontend/src/pages/onboarding/RewardSystemStep.tsx": "Lets the user choose a preferred reward system and continues once one is selected.",
  "frontend/src/pages/onboarding/ThemeSelectionStep.tsx": "Loads available world themes and allows the user to select one before advancing.",
  "frontend/src/pages/onboarding/WelcomeStep.tsx": "Displays the initial welcome screen inviting the user to start onboarding.",
  "frontend/src/pages/parent/ParentDashboardPage.tsx": "Checks admin status and, if allowed, shows tabs for managing tasks, rewards, and themes; otherwise offers admin setup.",
  "frontend/src/pages/settings/SettingsPage.tsx": "Provides UI to switch between kids and adults interface modes using toggles.",
  "frontend/src/pages/store/RewardsStorePage.tsx": "Page component that loads user profile and available rewards, shows points balance, and renders redeemable RewardCard items with kids-mode styling.",
  "frontend/src/pages/WelcomePage.tsx": "Landing page presenting the app's core features, themed visuals, and a login button. Adapts typography based on kids/adults mode.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project state file describing the ChoreQuest app vision, architecture notes, issues, and implemented features metadata."
}